# Create Database.db

In [1]:
import pandas as pd
import sqlite3

In [2]:
con = sqlite3.connect("data/database.db")
cur = con.cursor()

# Film_Locations_in_San_Francisco

In [9]:
df = pd.read_csv('data/Film_Locations_in_San_Francisco.csv')
df.head()

,Title,Release Year,Locations,Fun Facts,Production Company,Distributor,Director,Writer,Actor 1,Actor 2,Actor 3
0,A Jitney Elopement,1915,20th and Folsom Streets,NaN,The Essanay Film Manufacturing Company,General Film Company,Charles Chaplin,Charles Chaplin,Charles Chaplin,Edna Purviance,NaN
1,A Jitney Elopement,1915,Golden Gate Park,"During San Francisco's Gold Rush era, the Park...",The Essanay Film Manufacturing Company,General Film Company,Charles Chaplin,Charles Chaplin,Charles Chaplin,Edna Purviance,NaN
2,Greed,1924,Cliff House (1090 Point Lobos Avenue),"In 1887, the Cliff House was severely damaged ...",Metro-Goldwyn-Mayer (MGM),Metro-Goldwyn-Mayer (MGM),Eric von Stroheim,Eric von Stroheim,Zasu Pitts,Gibson Gowland,Jean Hersholt
3,Greed,1924,Bush and Sutter Streets,NaN,Metro-Goldwyn-Mayer (MGM),Metro-Goldwyn-Mayer (MGM),Eric von Stroheim,Eric von Stroheim,Zasu Pitts,Gibson Gowland,Jean Hersholt
4,Greed,1924,Hayes Street at Laguna,NaN,Metro-Goldwyn-Mayer (MGM),Metro-Goldwyn-Mayer (MGM),Eric von Stroheim,Eric von Stroheim,Zasu Pitts,Gibson Gowland,Jean Hersholt

In [10]:
df.to_sql('FilmLocations', con=con, index=False)

1976

# Instructor

In [3]:
df = pd.read_csv('data/Instructor.csv')
df.head()

   ins_id   lastname firstname     city country
0       1      Ahuja       Rav  Toronto      CA
1       2      Chong      Raul  Toronto      CA
2       3  Vasudevan      Hima  Chicago      US

In [4]:
df.to_sql('Instructor', con=con, index=False)

3

# Employees

In [3]:
query = '''
			CREATE TABLE EMPLOYEES (EMP_ID CHAR(9) NOT NULL,
                          			F_NAME VARCHAR(15) NOT NULL,
									L_NAME VARCHAR(15) NOT NULL,
									SSN CHAR(9),
									B_DATE DATE,
									SEX CHAR,
									ADDRESS VARCHAR(30),
									JOB_ID CHAR(9),
									SALARY DECIMAL(10,2),
									MANAGER_ID CHAR(9),
									DEP_ID CHAR(9) NOT NULL,
									PRIMARY KEY (EMP_ID));
    	'''
cur.execute(query)

In [8]:
column_names = ['EMP_ID', 'F_NAME', 'L_NAME', 'SSN', 'B_DATE', 'SEX', 'ADDRESS', 'JOB_ID', 'SALARY', 'MANAGER_ID', 'DEP_ID']

df = pd.read_csv('data/Employees.csv', header=None, names=column_names)
df.head()

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID
0,E1001,John,Thomas,123456,01/09/1976,M,"5631 Rice, OakPark,IL",100,100000,30001,2
1,E1002,Alice,James,123457,07/31/1972,F,"980 Berry ln, Elgin,IL",200,80000,30002,5
2,E1003,Steve,Wells,123458,08/10/1980,M,"291 Springs, Gary,IL",300,50000,30002,5
3,E1004,Santosh,Kumar,123459,07/20/1985,M,"511 Aurora Av, Aurora,IL",400,60000,30004,5
4,E1005,Ahmed,Hussain,123410,01/04/1981,M,"216 Oak Tree, Geneva,IL",500,70000,30001,2

In [9]:
df.to_sql('EMPLOYEES', con=con, index=False, if_exists='append')

10

# Job History

In [10]:
query = '''
			CREATE TABLE JOB_HISTORY (	EMPL_ID CHAR(9) NOT NULL,
										START_DATE DATE,
										JOBS_ID CHAR(9) NOT NULL,
										DEPT_ID CHAR(9),
										PRIMARY KEY (EMPL_ID,JOBS_ID));
    	'''
cur.execute(query)

In [11]:
column_names = ['EMPL_ID', 'START_DATE', 'JOBS_ID', 'DEPT_ID']

df = pd.read_csv('data/JobsHistory.csv', header=None, names=column_names)
df.head()

  EMPL_ID  START_DATE  JOBS_ID  DEPT_ID
0   E1001  08/01/2000      100        2
1   E1002  08/01/2001      200        5
2   E1003  08/16/2001      300        5
3   E1004  08/16/2000      400        5
4   E1005  05/30/2000      500        2

In [12]:
df.to_sql('JOB_HISTORY', con=con, index=False, if_exists='append')

10

# Jobs

In [13]:
query = '''
			CREATE TABLE JOBS ( JOB_IDENT CHAR(9) NOT NULL,
								JOB_TITLE VARCHAR(30) ,
								MIN_SALARY DECIMAL(10,2),
								MAX_SALARY DECIMAL(10,2),
								PRIMARY KEY (JOB_IDENT));
    	'''
cur.execute(query)

In [14]:
column_names = ['JOB_IDENT', 'JOB_TITLE', 'MIN_SALARY', 'MAX_SALARY']

df = pd.read_csv('data/Jobs.csv', header=None, names=column_names)
df.head()

   JOB_IDENT              JOB_TITLE  MIN_SALARY  MAX_SALARY
0        100          Sr. Architect       60000      100000
1        200  Sr.Software Developer       60000       80000
2        300  Jr.Software Developer       40000       60000
3        400  Jr.Software Developer       40000       60000
4        500          Jr. Architect       50000       70000

In [15]:
df.to_sql('JOBS', con=con, index=False, if_exists='append')

10

# Departments

In [16]:
query = '''
			CREATE TABLE DEPARTMENTS ( 	DEPT_ID_DEP CHAR(9) NOT NULL,
										DEP_NAME VARCHAR(15) ,
										MANAGER_ID CHAR(9),
										LOC_ID CHAR(9),
										PRIMARY KEY (DEPT_ID_DEP));
    	'''
cur.execute(query)

In [17]:
column_names = ['DEPT_ID_DEP', 'DEP_NAME', 'MANAGER_ID', 'LOC_ID']

df = pd.read_csv('data/Departments.csv', header=None, names=column_names)
df.head()

   DEPT_ID_DEP         DEP_NAME  MANAGER_ID LOC_ID
0            2  Architect Group       30001  L0001
1            5   Software Group       30002  L0002
2            7      Design Team       30003  L0003

In [18]:
df.to_sql('DEPARTMENTS', con=con, index=False, if_exists='append')

3

# Locations

In [19]:
query = '''
			CREATE TABLE LOCATIONS (LOCT_ID CHAR(9) NOT NULL,
									DEP_ID_LOC CHAR(9) NOT NULL,
									PRIMARY KEY (LOCT_ID,DEP_ID_LOC));
    	'''
cur.execute(query)

In [20]:
column_names = ['LOCT_ID', 'DEP_ID_LOC']

df = pd.read_csv('data/Locations.csv', header=None, names=column_names)
df.head()

  LOCT_ID  DEP_ID_LOC
0   L0001           2
1   L0002           5
2   L0003           7

In [21]:
df.to_sql('LOCATIONS', con=con, index=False, if_exists='append')

3

# PETRESCUE

In [ ]:
query = '''
			CREATE TABLE PETRESCUE (ID INTEGER NOT NULL,
									ANIMAL VARCHAR(20),
									QUANTITY INTEGER,
									COST DECIMAL(6,2),
									RESCUEDATE DATE,
									PRIMARY KEY (ID));
    	'''
cur.execute(query)

In [4]:
query = '''
            INSERT INTO PETRESCUE 
            VALUES  (1,'Cat',9,450.09,'2018-05-29'),
                    (2,'Dog',3,666.66,'2018-06-01'),
                    (3,'Dog',1,100.00,'2018-06-04'),
                    (4,'Parrot',2,50.00,'2018-06-04'),
                    (5,'Dog',1,75.75,'2018-06-10'),
                    (6,'Hamster',6,60.60,'2018-06-11'),
                    (7,'Cat',1,44.44,'2018-06-11'),
                    (8,'Goldfish',24,48.48,'2018-06-14'),
                    (9,'Dog',2,222.22,'2018-06-15');
    	'''
cur.execute(query)

In [5]:
query = '''
            SELECT *
            FROM PETRESCUE
        '''

df = pd.read_sql_query(query, con)
df.head()

   ID  ANIMAL  QUANTITY    COST  RESCUEDATE
0   1     Cat         9  450.09  2018-05-29
1   2     Dog         3  666.66  2018-06-01
2   3     Dog         1  100.00  2018-06-04
3   4  Parrot         2   50.00  2018-06-04
4   5     Dog         1   75.75  2018-06-10

In [ ]:
con.commit()

In [7]:
con.close()